// Конкурентное возведение в квадрат
//
// Написать программу, которая конкурентно рассчитает значения квадратов чисел, взятых из массива [2,4,6,8,10],
// и выведет результаты в stdout.
//
// Подсказка: запусти несколько горутин, каждая из которых возводит число в квадрат.
//
/////////////////////////////////////////////////////////////////////////////////////////////

package main

import (
	"fmt"
	"sync"
)

func main() {

	numbers := []int{2, 4, 6, 8, 10}

	var wg sync.WaitGroup

	for _, n := range numbers {

		wg.Add(1)

		go func(x int) {
			defer wg.Done()
			fmt.Printf("%d^2 = %d\n", x, x*x)

		}(n)
	}

	wg.Wait()
}
