// Группировка температур
//
// Дана последовательность температурных колебаний: -25.4, -27.0, 13.0, 19.0, 15.5, 24.5, -21.0, 32.5. Объединить эти значения в группы с шагом 10 градусов.
//
// Пример: -20:{-25.4, -27.0, -21.0}, 10:{13.0, 19.0, 15.5}, 20:{24.5}, 30:{32.5}.
//
// Пояснение: диапазон -20 включает значения от -20 до -29.9, диапазон 10 – от 10 до 19.9, и т.д. Порядок в подмножествах не важен.
//
////////////////////////////////////////////////////////////////////////////////////////

package main

import "fmt"

func main() {

	groups := make(map[int][]float64)

	seq := []float64{-25.4, -27.0, 13.0, 19.0, 15.5, 24.5, -21.0, 32.5}
	for _, v := range seq {
		gi := int(v / 10)
		groups[gi*10] = append(groups[gi*10], v)
	}

	for i, k := range groups {
		// fmt.Println(k)
		fmt.Printf("%d: %v\n", i, k)
	}

}
